from _1 import *
def tests_Incremental():
    test_cases = {
        "0. Αρχικό Παράδειγμα": set([(10,27), (5,6), (7,8), (0,2), (2,5)]),
        "1. Απλό Τρίγωνο": set([(0, 0), (5, 0), (0, 5)]),
        "2. Τετράγωνο με εσωτερικό σημείο": set([(0, 0), (10, 0), (10, 10), (0, 10), (5, 5)]),
        "3. Συνευθειακά σε μία ακμή": set([(0, 0), (5, 0), (10, 0), (0, 10)]),
        "4. Τέλεια Ευθεία": set([(1, 1), (2, 2), (3, 3), (4, 4), (5, 5)]),
        "5. Αρνητικές Συντεταγμένες": set([(-5, -5), (-5, 5), (5, -5), (5, 5), (0, 0)]),
        "6. Κάθετη Ευθεία (Ίδια x)": set([(2, 1), (2, 2), (2, 3), (2, 4), (2, 5), (1, 3), (3, 3)]),
        "7. Όλα τα σημεία στο περίβλημα": set([(0, 5), (3, 8), (8, 8), (11, 5), (8, 2), (3, 2)]),
        "8. Πυκνά όρια ορθογωνίου": set([(0, 0), (2, 0), (4, 0), (4, 2), (4, 4), (2, 4), (0, 4), (0, 2)]),
        "9. Σύννεφο με πολλά εσωτερικά": set([(1, 1), (9, 1), (9, 9), (1, 9), (3, 3), (4, 5), (6, 4), (7, 7), (5, 2)]),
        "10. Μόνο 2 σημεία": set([(0, 0), (10, 10)])
    }

    # Τρέχουμε τα Test Cases και τυπώνουμε τα αποτελέσματα
    print("="*50)
    print(" ΑΠΟΤΕΛΕΣΜΑΤΑ CONVEX HULL ".center(50, "="))
    print("="*50 + "\n")

    for name, points in test_cases.items():
        result = Incremental(points)
        print(f"{name}")
        print(f"Points : {sorted(list(points))}")
        print(f"Result : {result}")
        print("-" * 50)

def tests_GiftWrapping():
    test_cases = {
        "0. Αρχικό Παράδειγμα": set([(10,27), (5,6), (7,8), (0,2), (2,5)]),
        "1. Απλό Τρίγωνο": set([(0, 0), (5, 0), (0, 5)]),
        "2. Τετράγωνο με εσωτερικό σημείο": set([(0, 0), (10, 0), (10, 10), (0, 10), (5, 5)]),
        "3. Συνευθειακά σε μία ακμή": set([(0, 0), (5, 0), (10, 0), (0, 10)]),
        "4. Τέλεια Ευθεία": set([(1, 1), (2, 2), (3, 3), (4, 4), (5, 5)]),
        "5. Αρνητικές Συντεταγμένες": set([(-5, -5), (-5, 5), (5, -5), (5, 5), (0, 0)]),
        "6. Κάθετη Ευθεία (Ίδια x)": set([(2, 1), (2, 2), (2, 3), (2, 4), (2, 5), (1, 3), (3, 3)]),
        "7. Όλα τα σημεία στο περίβλημα": set([(0, 5), (3, 8), (8, 8), (11, 5), (8, 2), (3, 2)]),
        "8. Πυκνά όρια ορθογωνίου": set([(0, 0), (2, 0), (4, 0), (4, 2), (4, 4), (2, 4), (0, 4), (0, 2)]),
        "9. Σύννεφο με πολλά εσωτερικά": set([(1, 1), (9, 1), (9, 9), (1, 9), (3, 3), (4, 5), (6, 4), (7, 7), (5, 2)]),
        "10. Μόνο 2 σημεία": set([(0, 0), (10, 10)])
    }

    # ==========================================
    # ΕΚΤΕΛΕΣΗ TEST CASES
    # ==========================================

    print("="*50)
    print(" ΑΠΟΤΕΛΕΣΜΑΤΑ GIFT WRAPPING ".center(50, "="))
    print("="*50 + "\n")

    for name, points in test_cases.items():
        # Μπορείς να αντικαταστήσεις την κλήση με τη δική σου συνάρτηση:
        result = GiftWrapping(points)
        
        print(f"{name}")
        print(f"Points : {sorted(list(points))}")
        print(f"Result : {result}")
        print("-" * 50)
tests_GiftWrapping()